{"intents": [{"patterns": ["Hi there", "How are you", "Is anyone there?", "Hello", "Good day", "Hiya", "Hello there", "Hello, how are you doing?", "hiiiiiiiii", "hi, what is up", "whatsup?", "wazzup?", "heylo, what's up?", "Howdy?", "How is your day going?", "Hola", "namaste", "Good morning", "good afternoon", "good evening", "Hey Kayra, how are you today?", "Hello, how are you doing today?", "hi how are you doing today?", "hi, how are you?", "hiya! how are you doing today?", "Hi, how is your day going?What have you been upto lately?", "What are you doing these days?"], "responses": ["Hello, thanks for asking", "Good to see you again", "Hi there, how can I help?", "howdy?"], "tag": "greeting"}, {"patterns": ["Hey, what name do you go by?", "hey, what is your name?", "hey, what do i call you?", "hey what should i call you?", "what name do you go by?", "what is your name?", "what do i call you?", "what's your first name?", "what is your good name?", "Name?", "Can i know your name?", "Hi my name is", "Hello my name is", "What name do you go by?", "Hey, what name do you go by?", "Hello, what name do you go by?", "hello, what should i call you?", "hello, what name do you go by?", "hello, what is your name?", "hello, what do i call you?", "hello, what should i call you?", "hi, what name do you go by?", "hi, what is your name?", "hi, what do i call you?", "hi, what should i call you?", "hiya, what name do you go by?", "hiya, what is your name?", "hiya, what do i call you?", "hiya, what should i call you?", "who are you?"], "responses": ["you can call me Kayra", "My name is Kayra", "I go by Kayra!", "people around here know me by the name Kayra ;)", "I'm Kayra. I'm here to be your friend, let's talk!"], "tag": "name"}, {"patterns": ["Bye", "bye bye", "seeya", "It was fun talking to you", "I had fun talking to you", "I had a great time", "I have to go", "Gotta go", "I have to take a leave", "This is where I leave", "This is my cue to leave", "Hope to talk to you soon", "Talk later?", "I will talk to you later", "Ttyl", "See you later", "Goodbye", "Can we talk later?", "We will continue this conversation later", "Au revior", "Adios", "Nice chatting to you, bye", "Till next time", "until next time", "we shall talk soon"], "responses": ["See you!", "Have a nice day", "Bye! Come back again soon."], "tag": "goodbye"}, {"patterns": ["Thanks", "Thank you so much", "Thanks a ton!", "Thank you for all your help", "Thanks for your help", "I'm so grateful for all your help!", "That was extremely helpful!", "Amazing thank you!", "Thank you for helping me", "You're the best!", "Thanks a bunch!", "I really appreciate all your help!", "I appreciate it", "that's very kind of you", "I owe you one for your help", "You rock!", "I can't thank you enough!", "what would i do without you", "You made my day!", "You're awesome!", "Thank you!", "That's helpful", "Awesome, thanks”, “Thanks for helping me"], "responses": ["Happy to help!", "Any time!", "My pleasure", "Glad I could help!"], "tag": "thanks"}, {"patterns": [], "responses": ["Sorry, I can't understand you", "Please give me more details.", "Not sure I understand"], "tag": "noanswer"}, {"patterns": ["How you could help me?", "What things can you help me with?", "How else can you help me?", "How can you help me?", "Show me what you got!", "Show me what you can do", "Tell me you how you can help", "what all can you do?", "What services do you provide?", "How can you support me?", "What do you do?", "What can you do?", "Whay can you do for me?What you can do?", "Show me some tricks you can do?", "Can you do anything?", "How are you helpful?", "Can i talk to you whenever?", "Come on, tell me what you can do!", "What is the story behind your website", "What do you really do?", "What help you provide?", "How you can be helpful?", "What support is offered"], "responses": ["I am Kayra, and I am here to listen! I was created by a bunch of nerds to face the greater pandemic infiltrating the world today - deteriorating mental health. I will listen when you talk, I'll help you recognise your inhibitions and work on overcoming them. I am a chatbot made with the help of in Cognitive Behavioural Therapy, which will allow me to assess your thinking and accordingly prepare a care plan! Put simply, I'll-be-there-for-youuuu, when-the-rain-starts-pourrrr!"], "tag": "options"}, {"patterns": ["I answered one question wrong, so I’m a failure", "Joan feels like a failure at getting sober. Every time she has a slip-up, instead of acknowledging that she made a mistake and trying to move past it, she drinks to ​intoxication the same night, figuring she has already blown it.", "I didn’t get the promotion, so I might as well quit my job", "I can’t face my fears because I won’t be able to cop", "I just got lucky that my proposal was accepted", "I got promoted at work, only because no one else wanted it", "It was an awful evening. I had to wait 30 minutes for my pizza.", "I got laid off. I’m a total loser", "You have a disagreement with your friend and you think to yourself: “that’s it; you’re not my friend anymore!”", "My boyfriend is an angel, or He’s the devil incarnate.", "I’m a terrible person.", "My boyfriend is the most attractive person I know and I’ll never be as into anyone else again.", "I ate a spoonful of ice cream. Now I think I am a complete failure for breaking my diet. (She becomes so depressed that she ends up eating the whole quart of ice cream)", "Lovely or awful. .", "Clever or stupid.", "Attractive or unattractive.", "Nice or horrible.", "Skinny or fat.", "Happy or miserable.", "Successful or a loser.", "Cool or a nerd.", "Authentic or fake.", "‘Things always go wrong’,", "‘I’ll never be truly happy’,", "‘she’s always late’,", "‘he’s never going to grow up’", "my colleague is evil", "she’s a horrible person and that I’ll never speak to her again because she didn’t behave as I expected her to", "I think she’s thoughtless", "All blond women are dumb", "Blacks are great basketball player", "Tanya either did things perfectly or not at all. If she saw the slightest speck of dust at home she saw it as ‘filthy’. She was similarly strict with descriptions of herself – she was either doing ok, or was failing in every way. Her thinking is biased because she fails to see life in the ‘shades of grey’ that it actually operates.", "David had grown up in a household where his parents were very critical and placed great emphasis on academic achievement. His brother did well academically but David always struggled to meet his parent’s high standards. He has developed the core belief “I’m useless” and the (protective) assumption “As long as I achieve I am ok”. When he fails a test he has the automatic thought “I’m a complete failure”", "Rochelle experienced a lot of abuse as a child. Her parents were neglectful, she was abused by a relative, and she was bullied throughout her school career. She held the beliefs “I am unlovable” and “People will only ever hurt me”. She was quick to assume that others were likely to harm her, felt anxious, and struggled to form meaningful relationships."], "responses": ["Yes, I am listening", "Your feelings are completely valid!", "We will work on that for sure", "And how does that make you feel?", "I am here for you", "Okay..", "Lets discuss that further"], "tag": "all or nothing"}, {"patterns": ["My boyfriend broke up with me. No one will ever love me.", "You’re not picked for the basketball team and you think, “I’m no good at sports; I just can’t do anything!”", "a student may receive a C on one test and conclude that she is stupid and a failure", "A young woman is asked out on a first date, but not a second one. She is distraught as she tells her friend, “This always happens to me! I’ll never find love!”", "A woman is lonely and often spends most of her time at home. Her friends sometimes ask her to dinner and to meet new people. She feels it is useless to even try. No one really could like her. And anyway, all people are the same; petty and selfish.", "I didn’t get a good mark on my exam. I’ll never do well in this class!", "I bought one plant and it died. I won’t ever have a nice garden because everything will die.", "I didn’t have friends in middle high school, ill never have friends in high school", "I wasn’t able to pass the test, ill never pass any tests", "Getting a low grade: this always happens to me", "I fail at everything I do", "Dropping a class: I never complete anything I embark on. I always quit", "I will never win anything, not even a lottery", "Carl gets a C- on a piece of homework, thinks to himself “I’m going to fail everything”, and feels hopeless", "“I’ll be lonely and miserable all my life”", "Why does this always happen to me?!", "“Why do I always hit every red light?”", "“Why does everyone walk so slowly?”", "It’s important to never let anyone down.", "Other people should never let me down.", "Being wrong is bad (If you have been cognitively flexible enough to realize a mistake you’re doing something right. Or, maybe you decided to prioritize something else ahead of avoiding the possibility of being wrong e.g. you decided to risk being wrong because you wanted to give someone a chance).", "I need to learn to love myself before anyone else will love me.", "I should avoid wasting anything.", "\"I'm not good enough\"", "\"I could never do that.\"", "\"I always screw up speeches. I never can speak publicly without messing up.\"", "when a man would think that all women are bad drivers", "I have the worst luck in the entire world.", "I just failed that math test. I’m no good at school, and I might as well quit.", "She’s late. It’s raining. She has hydroplaned and her car is upside down in a ditch.", "Iscored bad in math again, im hopeless in math in general", "I ate too much dessert. I feel like a disgusting pig."], "responses": ["Yes, I am listening", "Your feelings are completely valid!", "We will work on that for sure", "And how does that make you feel?", "I am here for you", "Okay..", "Lets discuss that further"], "tag": "overgeneralization"}, {"patterns": ["You receive a compliment and tell yourself the person didn’t really mean the nice thing they said", "Joel compulsively seduces then rejects strangers because he discounts all of the positive non-sexual human interactions, he has each day, since they aren't as intense or pleasurable as having sex with a stranger.", "You think someone is only being nice to you because they don’t want to hurt your feelings, not because they actually like you and enjoy spending time with you", "She said “you really look good today” , only because she does wants to make me feel bad about my skin colour", "You are only saying that to make me feel better", "After acing an interview, you might comment, “Oh, it was nothing really. They probably would have hired anyone.”", "I'm furious with you, this proves that you've been acting badly and trying to take advantage of me", "I feel so lousy when I think about that messy desk, cleaning it will be impossible.", "Six months later he finally gives himself a little push and does it", "It turns out to be quite gratifying and not so tough at all", "He was fooling himself all along because he had adopted the habit of letting his negative feelings guide the way he acted", "You a pass a test and think, “I passed because it was so easy”", "a person who receives a positive review at work might reject the idea that they are a competent employee and attribute the positive review to political correctness, or to their boss simply not wanting to talk about their employee’s performance problems.", "\"I will never be as good as Jane\"", "\"They are just congratulating me to be nice\"", "\"Anyone could have done as well", "Ken spends his life savings looking for a pill to take away his pain and depression.", "imagine you’ve invited some friends around for dinner and you’ve made a beautiful meal from scratch and a delicious dessert. When you prepare to add some fresh blueberries to the dessert, you realise you were actually supposed to get raspberries and when you taste the dessert, the flavours don’t quite match. Even though everyone compliments you on all the wonderful things you cooked and tell you the dessert is still delicious, all you can think about is how annoyed you are about not reading the recipe properly and getting the wrong berries. You’ve magnified a small mistake and essentially, made a mountain out of a molehill", "Paul’s baby is sick on his only clean shirt before he has to go to work to give a presentation. He has an image of his boss noticing, giving him a disgusted look, and firing him on the spot.", "Emma’s friend was the third person to try to tell her that she thought Emma was drinking too much and putting herself in danger. Emma dismissed her concerns by saying “You’re like everyone else, you worry too much” and thought to herself “I don’t know what they’re all so worried about”.", "the problem isn’t you – it’s the crazy lenses you’re wearing!", "I can’t believe I said that. My life is over!", "I’m not that good at my job"], "responses": ["Yes, I am listening", "Your feelings are completely valid!", "We will work on that for sure", "And how does that make you feel?", "I am here for you", "Okay..", "Lets discuss that further"], "tag": "discounting the positive"}, {"patterns": ["If I fail this test, I will never pass school, and I will be a total failure in life", "If I don’t recover quickly from this procedure, I will never get better, and I will be disabled my entire life", "If my partner leaves me, I will never find anyone else, and I will never be happy again", "Student worries they will fail an exam.", "Student jumps to the conclusion that failing an exam would be a catastrophe. They imagine that if they were to fail an exam, it would mean they would never be a success in their life.", "An individual with panic disorder predicts that if they go to the mall on a weekend afternoon, they will have a panic attack. They predict that having a panic attack would be a catastrophe, rather than it just being significantly unpleasant.", "Imagining yourself spiraling into a deep depression", "Imagining yourself never finding love, and imagining that if this happens you will be plagued by intense feelings of lonliness 24/7 from now until you die.", "Equating some type of mild to moderate social rejection with being totally shunned by all desirable people", "When you’re convinced that you’re either destined for success or doomed to failure, that the people in your life are either angelic or evil, you’re probably engaging in polarized thinking.", "you make a low score on one math test and conclude that you’re hopeless at math in general. You have a negative experience in one relationship and develop a belief that you just aren’t good at relationships at all.", "an expected check doesn’t arrive in the mail. A person who catastrophizes may begin to fear it will never arrive, and that as a consequence it won’t be possible to pay rent and the whole family will be evicted.", "a student may receive a C on one test and conclude that she is stupid and a failure. Overgeneralizing can lead to overly negative thoughts about yourself and your environment based on only one or two experiences.", "a person who receives a positive review at work might reject the idea that they are a competent employee and attribute the positive review to political correctness, or to their boss simply not wanting to talk about their employee’s performance problems.", "Seeing a stranger with an unpleasant expression and jumping to the conclusion that they are thinking something negative about you is an example of this distortion.(jumping to conclusions)", "telling is a young, single woman predicting that she will never find love or have a committed and happy relationship based only on the fact that she has not found it yet. There is simply no way for her to know how her life will turn out, but she sees this prediction as fact rather than one of several possible outcomes.", "An athlete who is generally a good player but makes a mistake may magnify the importance of that mistake and believe that he is a terrible teammate, while an athlete who wins a coveted award in her sport may minimize the importance of the award and continue believing that she is only a mediocre player.", "“I feel it, therefore it must be true.” Just because we feel something doesn’t mean it is true; for example, we may become jealous and think our partner has feelings for someone else, but that doesn’t make it true. Of course, we know it isn’t reasonable to take our feelings as fact, but it is a common distortion nonetheless.", "a student who labels herself as “an utter fool” for failing an assignment is engaging in this distortion, as is the waiter who labels a customer “a grumpy old miser” if he fails to thank the waiter for bringing his food. Mislabeling refers to the application of highly emotional, loaded, and inaccurate or unreasonable language when labeling.", "If we break up, I'll always be alone.\"", "What if my family gets sick and I never see them again?\"", "\"What interpretations or assumptions am I making about the event?\"", "\"Does my emotion and its intensity match the facts of the situation? Or does it just match my assumptions of the situation?\"", "\"How likely is it that my worry will come true?\"", "\"If my worry comes true, what are the chances I'll be okay in one week? One month? One year?", "“I dropped my book and the whole class is laughing at me and no one will like me now because I’m a klutz”", "“Just because she sat with me one day doesn’t mean that she really likes me”", "An athlete who is generally a good player but makes a mistake may magnify the importance of that mistake and believe that he is a terrible teammate, while an athlete who wins a coveted award in her sport may minimize the importance of the award and continue believing that she is only a mediocre player."], "responses": ["Yes, I am listening", "Your feelings are completely valid!", "We will work on that for sure", "And how does that make you feel?", "I am here for you", "Okay..", "Lets discuss that further"], "tag": "catastrophizing"}, {"patterns": ["I want this very badly, and you are a bad person if you don’t provide it to me", "If you loved me you would…", "I cant control any of this! I feel so stuck.", "This is all my fault. I should have done something more.", "How can i change these patterns?", "I cant help it if the quality of the work is poor, my boss demanded i work overtime on it. (EC)", "Why are you not happy? Is it because off something i did?(IC)", "I am too old to try dating, nobody will want me.", "The men who robbed me made me feel i cant leave the house.", "There is no point in trying", "What hope do i have to change.", "What choices have i made that resulted in this situation?", "What decisions can i make now to change it?", "The economy means there is no point in trying to find a job.", "If he loved me, he would do the dishes.", "If he cared at all, he would come home right after work.", "If they valued my work here, they would get me a nicer desk.", "“If I just encourage my wife to stop doing the things that irritate me, I can be a better husband and a happier person”", "eating a certain type of food before a sports game will secure the win", "wearing a particular dress means a romantic date will go well", "losing a certain amount of weight will result in a promotion at work", "people with obsessive-compulsive disorder may engage in rituals that give them a sense of control over other events.", "a person with OCD may feel that washing their hands a certain number of times will protect a loved one from harm.", "I am feeling better this morning, but if I tell anyone the pain might get worse"], "responses": ["Yes, I am listening", "Your feelings are completely valid!", "We will work on that for sure", "And how does that make you feel?", "I am here for you", "Okay..", "Lets discuss that further"], "tag": "fallacy"}]}